In [71]:
#Dependencies and Setup
import pandas as pd
import os

#File to load
schools_data_csv_in = os.path.join('Resources', 'schools_complete.csv')
student_data_csv_in = os.path.join('Resources','students_complete.csv')

#Read school and Student Data File and store into Pandas Dataframe
school_data_df = pd.read_csv(schools_data_csv_in)
student_data_df = pd.read_csv(student_data_csv_in)

#Combine the DataFrames into a single dataset
school_data_complete_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
                                                                      
school_data_complete_df.head()

,Student ID,student_name,gender,year,school_name,reading_score,maths_score,School ID,type,size,budget
0,0,Paul Bradley,M,9,Huang High School,96,94,0,Government,2917,1910635
1,1,Victor Smith,M,12,Huang High School,90,43,0,Government,2917,1910635
2,2,Kevin Rodriguez,M,12,Huang High School,41,76,0,Government,2917,1910635
3,3,Richard Scott,M,12,Huang High School,89,86,0,Government,2917,1910635
4,4,Bonnie Ray,F,9,Huang High School,87,69,0,Government,2917,1910635

In [81]:
# Display a Statistical Overview
school_data_complete_df.describe()

,Student ID,year,reading_score,maths_score,School ID,size,budget
count,39170.000000,39170.000000,39170.000000,39170.000000,39170.000000,39170.000000,3.917000e+04
mean,19584.500000,10.359586,69.980138,70.338192,6.978172,3332.957110,2.117241e+06
std,11307.549359,1.102779,17.242346,16.910154,4.444329,1323.914069,8.749987e+05
min,0.000000,9.000000,39.000000,39.000000,0.000000,427.000000,2.480870e+05
25%,9792.250000,9.000000,55.000000,56.000000,3.000000,1858.000000,1.081356e+06
50%,19584.500000,10.000000,70.000000,70.000000,7.000000,2949.000000,1.910635e+06
75%,29376.750000,11.000000,85.000000,85.000000,11.000000,4635.000000,3.022020e+06
max,39169.000000,12.000000,99.000000,99.000000,14.000000,4976.000000,3.124928e+06

In [82]:
# Display a list of all the columns
school_data_complete_df.columns

Index(['Student ID', 'student_name', 'gender', 'year', 'school_name',
       'reading_score', 'maths_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [83]:
# Calculate the number of schools

school_count = school_data_complete_df["school_name"].nunique()
print('Number of Schools: {:,}'.format(school_count))

Number of Schools: 15

In [101]:
# Calculate the number of students

student_count = school_data_complete_df["school_name"].count()
print('Number of Students: {:,}'.format(student_count))

Number of Students: 39,170

In [102]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [114]:
# Calculate the total budget

school_budget_total = school_data_df["budget"].sum()
print('Total_Budget: ${:,.2F}'.format(school_budget_total))

Total_Budget: $24,649,428.00

In [115]:
student_budget = (school_budget_total) / (student_count)
print('per Student_Budget: ${:,.2F}'.format(student_budget))

per Student_Budget: $629.29